{"ascii":"⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⢀⣀⣠⣴⣶⣶⣶⡶⠶⣤⣠⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⢿⣿⣷⡆⠀⢹⡷⡦⠀⢸⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⢸⣿⣷⣤⣴⢻⣟⣶⣶⣿⣿⡇⠀⠀⠀⠀⠀⠀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⢀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⢸⣿⣿⣿⣿⣧⣼⣿⣿⣿⣿⣿⠀⠀⠀⠀⢠⣾⡿⠛⠛⠿⠀⠀⣀⣀⡀⠀⢸⣿⠀⢀⣀⣀⡀⠀⣀⢀⣀⡀⠀⢀⣀⣀⣀⡀⠀⠀⠀\n⠀⠀⠀⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⠀⠀⠀⣿⣿⠀⠠⣤⣤⣄⣾⡟⠙⣿⡆⢸⣿⠀⠛⢋⣻⣿⠀⣿⡟⢹⣿⡆⣿⣏⣹⣿⠁⠀⠀⠀\n⠀⠀⠀⠘⢺⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠈⠀⠀⠀⠘⣿⣦⣀⣸⣿⡏⣿⣇⣠⣿⠇⢸⣿⠠⣿⣟⣹⣿⠀⣿⡇⢸⣿⡇⣾⣿⣿⣅⡀⠀⠀⠀\n⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠀⠈⠉⠉⠁⠀⠈⠉⠀⠉⠉⠉⠉⠀⠉⠁⠈⠉⠱⣿⣭⣭⣿⠇⠀⠀⠀\n⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣿⣿⣿⣿⣟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠃⠊⠉⠛⠛⠛⠛⠉⠉⠚⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀","description":"Привет! Я хомяк Валерчик — не просто милый зверёк, а настоящий Go Gopher!\nЯ родился в мире высоких технологий, где каждое приложение летает, как ветер. Мои острые глазки замечают даже самые незаметные ошибки в коде, а лапки так быстро перебирают байты, что никто не может угнаться.\n\nЯ символизирую простоту, надёжность и скорость разработки на языке Go. Я всегда рад новым проектам, не боюсь многопоточности и уверенно шагаю в продакшн.\n\nА теперь давай я расскажу, как работает эта SPA-страничка.\nВнизу есть синяя рамочка с двумя полями: одно — для ASCII-картинки питомца, другое — для его описания. Чуть ниже находится тумблер для выбора валидации (по умолчанию включена строгая валидация, допускающая только 128 символов). В строгой валидации ты не сможешь нарисовать рисунок, похожий на меня, но зато есть гибкая валидация, которая позволяет творить настоящих ASCII-хомяков!\n\nКнопка \"Сохранить\" отправляет JSON-файл на сервер и тут же отображает его у тебя на экране.\n\nС нижним полем разобрались — теперь перейдём к отображению рисунка. Тут, как видишь, тоже два поля: картинка и описание. Каждое из них можно скопировать, нажав на иконку копирования.(Копирование работает на localhost и на https)\n\nМой изобретатель решил добавить ещё один метод — DELETE — для удаления JSON-файла. Я знаю, что в Swagger-спецификации было всего два метода: PUT и GET. Можно было бы удалять картинку пустыми значениями, но мы решили сделать проверку на пустоту, а потому и добавили отдельный метод.\n\nЕсли захочешь — просто нажми на иконку удаления в верхнем правом углу, и рисунок исчезнет.\n\nРад был познакомиться!"}